test/artillery/patient-request2.yaml
config:
  target: "http://localhost:3000"
  phases:
    - arrivalRate: 5
      duration: 10
  payload:
    path: "concurrency.test.script.csv"
    order: random
    delimiter: "|"
    skipHeader: true
    fields:
      - "symptoms"
      - "age_range"
      - "patient_id"
      
scenarios:
  - flow: 
    - log: "증상 보고서 입력 POST 요청 시도"
    - post:
        url: "http://localhost:3000/report"
        json:
          symptoms: '저체온증'
          age_range: '성인'
        capture:
          json: "$.report_id"
          as: "report_id"
    - log: "환자 이송 신청 POST 요청 시도"
    - post:
        url: "http://localhost:3000/request/{{report_id}}/2"